In [1]:
import pandas as pd
import numpy as np

In [4]:
from datetime import datetime
df = pd.DataFrame({'nombres':('Juan Pérez',
                                 'María Sánchez'
                                 , 'Jorge Vargas',
                                 'Rodrigo Martínez'),
            'fechas':(datetime(1995,12,21), 
                      datetime(1989,1,13), 
                      datetime(1992,9,14), 
                      datetime(1993,7,8)),
            'saldo': (2500, 
                      5345, 
                      np.NaN, 
                      11323.2),
            'al_corriente':(True, 
                            True, 
                            False, 
                            True)})

df

            nombres     fechas    saldo  al_corriente
0        Juan Pérez 1995-12-21   2500.0          True
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [5]:
#Operador .iloc
#data.iloc[<filas>, <columnas>]

df.iloc[0] # Primer fila

nombres                  Juan Pérez
fechas          1995-12-21 00:00:00
saldo                        2500.0
al_corriente                   True
Name: 0, dtype: object

In [6]:
df.iloc[1]

nombres               María Sánchez
fechas          1989-01-13 00:00:00
saldo                        5345.0
al_corriente                   True
Name: 1, dtype: object

In [8]:
df.iloc[-1] # ultima fila

nombres            Rodrigo Martínez
fechas          1993-07-08 00:00:00
saldo                       11323.2
al_corriente                   True
Name: 3, dtype: object

In [9]:
df.iloc[:,0] # primera columna

0          Juan Pérez
1       María Sánchez
2        Jorge Vargas
3    Rodrigo Martínez
Name: nombres, dtype: object

In [10]:
df.iloc[:,1] # Segunda columna

0   1995-12-21
1   1989-01-13
2   1992-09-14
3   1993-07-08
Name: fechas, dtype: datetime64[ns]

In [11]:
df.iloc[:,-1] # ultima columna

0     True
1     True
2    False
3     True
Name: al_corriente, dtype: bool

In [12]:
df.iloc[1:3] # Rango de filas

         nombres     fechas   saldo  al_corriente
1  María Sánchez 1989-01-13  5345.0          True
2   Jorge Vargas 1992-09-14     NaN         False

In [14]:
df.iloc[0:3:2] # Rango de filas

        nombres     fechas   saldo  al_corriente
0    Juan Pérez 1995-12-21  2500.0          True
2  Jorge Vargas 1992-09-14     NaN         False

In [20]:
df.iloc[:,1:3] # Rango de columnas

      fechas    saldo
0 1995-12-21   2500.0
1 1989-01-13   5345.0
2 1992-09-14      NaN
3 1993-07-08  11323.2

In [21]:
df.iloc[[1,3,0],[1,3,0]] # lista de filas

      fechas  al_corriente           nombres
1 1989-01-13          True     María Sánchez
3 1993-07-08          True  Rodrigo Martínez
0 1995-12-21          True        Juan Pérez

In [22]:
df.iloc[1,[1,3,0]]

fechas          1989-01-13 00:00:00
al_corriente                   True
nombres               María Sánchez
Name: 1, dtype: object

In [23]:
df.iloc[1,:]

nombres               María Sánchez
fechas          1989-01-13 00:00:00
saldo                        5345.0
al_corriente                   True
Name: 1, dtype: object

In [24]:
df.iloc[1,'fechas'] # iloc no trabaja con etiquetas

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [28]:
# .loc recupera filas y columnas con etiquetas o una matriz booleana

df.loc[1:3]

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [29]:
df.loc[:,'saldo']

0     2500.0
1     5345.0
2        NaN
3    11323.2
Name: saldo, dtype: float64

In [31]:
df.loc[:,'saldo':'al_corriente']

     saldo  al_corriente
0   2500.0          True
1   5345.0          True
2      NaN         False
3  11323.2          True

In [32]:
df.loc[:,'saldo':'fechas']

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [34]:
df.loc[:,'fechas':'saldo']

      fechas    saldo
0 1995-12-21   2500.0
1 1989-01-13   5345.0
2 1992-09-14      NaN
3 1993-07-08  11323.2

In [35]:
df.loc[:,['fechas', 'saldo', 'nombres']]

      fechas    saldo           nombres
0 1995-12-21   2500.0        Juan Pérez
1 1989-01-13   5345.0     María Sánchez
2 1992-09-14      NaN      Jorge Vargas
3 1993-07-08  11323.2  Rodrigo Martínez

In [36]:
df.loc[1,['fechas', 'saldo', 'nombres']]

fechas     1989-01-13 00:00:00
saldo                   5345.0
nombres          María Sánchez
Name: 1, dtype: object

In [37]:
df.loc[1:3,['fechas', 'saldo', 'nombres']]

      fechas    saldo           nombres
1 1989-01-13   5345.0     María Sánchez
2 1992-09-14      NaN      Jorge Vargas
3 1993-07-08  11323.2  Rodrigo Martínez

In [38]:
df.loc[[1,3,2],['fechas', 'saldo', 'nombres']] # Rango de columnas

      fechas    saldo           nombres
1 1989-01-13   5345.0     María Sánchez
3 1993-07-08  11323.2  Rodrigo Martínez
2 1992-09-14      NaN      Jorge Vargas

In [42]:
df_iloc = df.iloc[1:3]
df_iloc

         nombres     fechas   saldo  al_corriente
1  María Sánchez 1989-01-13  5345.0          True
2   Jorge Vargas 1992-09-14     NaN         False

In [43]:
print(df_iloc.loc[1])
print("--------".center(60,'*'))
print(df.loc[1])

nombres               María Sánchez
fechas          1989-01-13 00:00:00
saldo                        5345.0
al_corriente                   True
Name: 1, dtype: object
**************************--------**************************
nombres               María Sánchez
fechas          1989-01-13 00:00:00
saldo                        5345.0
al_corriente                   True
Name: 1, dtype: object

In [44]:
df['saldo'] > 3000

0    False
1     True
2    False
3     True
Name: saldo, dtype: bool

In [45]:
df.loc[df['saldo'] > 3000]

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [46]:
df.loc[df['saldo'] > 3000, ['nombres', 'saldo']]

            nombres    saldo
1     María Sánchez   5345.0
3  Rodrigo Martínez  11323.2

In [51]:
ss3 = df['saldo'] > 3000
print(type(ss3))
ss3

<class 'pandas.core.series.Series'>

0    False
1     True
2    False
3     True
Name: saldo, dtype: bool

In [52]:
df.loc[ss3]

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [53]:
df.loc[~ss3]

        nombres     fechas   saldo  al_corriente
0    Juan Pérez 1995-12-21  2500.0          True
2  Jorge Vargas 1992-09-14     NaN         False

In [54]:
df['al_corriente']

0     True
1     True
2    False
3     True
Name: al_corriente, dtype: bool

In [55]:
df.loc[df['al_corriente']]

            nombres     fechas    saldo  al_corriente
0        Juan Pérez 1995-12-21   2500.0          True
1     María Sánchez 1989-01-13   5345.0          True
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [56]:
df.loc[df['al_corriente'], 'nombres':'saldo']

            nombres     fechas    saldo
0        Juan Pérez 1995-12-21   2500.0
1     María Sánchez 1989-01-13   5345.0
3  Rodrigo Martínez 1993-07-08  11323.2

In [57]:
df.isnull()

   nombres  fechas  saldo  al_corriente
0    False   False  False         False
1    False   False  False         False
2    False   False   True         False
3    False   False  False         False

In [58]:
df.isnull().sum()

nombres         0
fechas          0
saldo           1
al_corriente    0
dtype: int64

In [59]:
df.isnull().sum().sum()

1

In [60]:
print(type(df.isnull().values))
df.isnull().values

<class 'numpy.ndarray'>

array([[False, False, False, False],
       [False, False, False, False],
       [False, False,  True, False],
       [False, False, False, False]])

In [61]:
df.isnull().values.any()

True

In [68]:
df.isnull().any()

nombres         False
fechas          False
saldo            True
al_corriente    False
dtype: bool

In [69]:
df[df.isnull().any(1)]

TypeError: NDFrame._add_numeric_operations.<locals>.any() takes 1 positional argument but 2 were given